
function text() {
};

text = new text();
number = 0;

// textArray
text[number++] = "心正、意正、念正、身正、眼正、走正，处末世方能动无不正。"
text[number++] = "世上学问皆小术，真正精深是佛法。"
text[number++] = "千百年来，真、善、忍是衡量好坏的唯一标准，人人应当遵守之。"
text[number++] = "无意即是有缘，偶然即是必然。不问客从何来，本站为缘而开。"
text[number++] = "天地万古，人生百年。生生世世、轮轮回回几个秋？期待已久，只为今朝，机缘斯地找。  —Google英文"
text[number++] = "修心无为日益精，真感了无一身轻。善念一出谁受益，忍今一时把共清。"
text[number++] = "悠悠岁月多漫长，生世轮回为谁茫？今日随缘来此处，尘封记忆在此敞。"
text[number++] = "岂由人世一日暗，救度众生真象显。他日人间法正时，拂袖穿云我是仙。"
text[number++] = "人当静养身体，素位而行，随遇而安，则心性和平，神气冲淡。 —水石闲谈·张三丰"
text[number++] = "窗外尘尘事，窗中梦梦身。既知身是梦，一任事如尘。"
text[number++] = "白日看云坐，清秋对雨眠。眉头无一事，笔下有千年。"
text[number++] = "过去事已过去了，未来不必预思量。只今只道即今句，梅子熟时栀子香。"
text[number++] = "眼空湖海气凌云，杰出丛林思不群。古往今来谁是我？得饶人处且饶人。"
text[number++] = "万丈寒潭澈底清，锦鳞夜静向光行。和竿一掣随钩上，水面茫茫散月明。"
text[number++] = "一年春尽又一春，野草山花几度新。天晓不因钟鼓动，月明非为夜行人。"
text[number++] = "举世尽为名利客，吾今独向道中醒。他时定见飞升去，冲破秋空一点青。 —道诗·重阳真人"
text[number++] = "来时无迹去无踪，去与来时事一同。何须更问浮生事？只此浮生是梦中。"
text[number++] = "似水如云一梦身，不知此外更何亲。个中不许容他物，分付黄梅路上人。"
text[number++] = "花非花，雾非雾，夜半来，天明去。来如春梦几多时，去似朝云无觅处。"
text[number++] = "练得身形似鹤形，千株松下两函经。我来问道无余说，云在青天水在瓶。"
text[number++] = "莫笑风尘满病颜，此生原在有无间。卷舒莲叶终难湿，去住云心一种闲。"
text[number++] = "蜗牛角上争何事，石火光中寄此生。随贫随富且随喜，不开口笑是痴人。"
text[number++] = "浩浩天风吹满楼，峰中云气涌林邱。雨声晌处檐铃杂，方丈萧然一院秋。 —清秋过岳云楼·邱长春"
text[number++] = "心如雪夜钟声，貌似霜天梅格。白云深处闲行，那识仙家旷逸。 —自赠·张紫琼"
text[number++] = "乾坤偌大似琼壶，拍板闲吟一丈夫。风雨长安春已暮，落花满地步于于。 —关中踏歌联句·韩、蓝、曹、何"
text[number++] = "欲做精金美玉的人品，定从烈火中煅来；思立掀天揭地的事功，须向薄冰上履过。 —菜根谭"
text[number++] = "拨开世上尘氛，胸中自无火焰冰竞；消却心中鄙吝，眼前时有月到风来。  —菜根谭"
text[number++] = "我果为洪炉大冶，何患顽金钝铁之不可陶熔。我果为巨海长江，何患横流污渎之不能容纳。  —菜根谭"
text[number++] = "欲遇变而无仓忙，须向常时念念守得定；欲临死而无贪恋，须向生时事事看得轻。  —菜根谭"
text[number++] = "随时之内善救时，若和风之消酷暑；混俗之中能脱俗，似淡月之映轻云。  —菜根谭"
text[number++] = "功名富贵，直从灭处观究竟，则贪恋自轻；横逆困穷，直从起处究由来，则怨尤自息。  —菜根谭"
text[number++] = "从静中观物动，向闲处看人忙，才得超尘脱俗的趣味；遇忙处会偷闲，处闹中能取静，便是安身立命的工。 —菜根谭"
text[number++] = "无事常如有事时，提防才可以弥意外之变；有事常如无事时，镇定方可以消局中之危。  —菜根谭"
text[number++] = "持身如泰山九鼎凝然不动，则愆尤自少；应事若流水落花悠然而逝，则趣味常多。  —菜根谭"
text[number++] = "遇事只一味镇定从容，纵纷若乱丝，终当就绪；待人无半毫矫伪欺隐，虽狡如山鬼，亦自献诚。  —菜根谭"
text[number++] = "梦里悬金佩玉，事事逼真，睡去虽真觉后假；闲中演偈谈元，言言酷似，说来虽是用时非。  —菜根谭"
text[number++] = "荣与辱共蒂，厌辱何须求荣；生与死同根，贪生不必畏死。  —菜根谭"
// keep adding items here...

increment = Math.floor(Math.random() * number);

document.write(text[increment]);


 
